## Terraform Plan & Apply �

### Plan: ✅ Success
### Apply: ❌ Failed

⚠️ **Apply failed - please review and fix before merging.**

<details>
<summary>Show Plan Output</summary>

```terraform
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-southeast-2]
data.aws_vpc.default: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=225989367801]
data.aws_vpc.default: Read complete after 2s [id=vpc-0bc3c549fb54ed59b]
data.aws_subnets.default: Reading...
data.aws_subnets.default: Read complete after 0s [id=ap-southeast-2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.app[0] will be created
  + resource "aws_cloudfront_distribution" "app" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + comment                         = "budgeteer API distribution"
      + continuous_deployment_policy_id = (known after apply)
      + domain_name                     = (known after apply)
      + enabled                         = true
      + etag                            = (known after apply)
      + hosted_zone_id                  = (known after apply)
      + http_version                    = "http2"
      + id                              = (known after apply)
      + in_progress_validation_batches  = (known after apply)
      + is_ipv6_enabled                 = false
      + last_modified_time              = (known after apply)
      + price_class                     = "PriceClass_All"
      + retain_on_delete                = false
      + staging                         = false
      + status                          = (known after apply)
      + tags                            = {
          + "Name" = "budgeteer-cloudfront"
        }
      + tags_all                        = {
          + "Name" = "budgeteer-cloudfront"
        }
      + trusted_key_groups              = (known after apply)
      + trusted_signers                 = (known after apply)
      + wait_for_deployment             = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = true
          + default_ttl            = 0
          + max_ttl                = 0
          + min_ttl                = 0
          + target_origin_id       = "budgeteer-alb"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "redirect-to-https"

          + forwarded_values {
              + headers                 = [
                  + "*",
                ]
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = (known after apply)
          + origin_id           = "budgeteer-alb"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "http-only"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudwatch_log_group.app will be created
  + resource "aws_cloudwatch_log_group" "app" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/ecs/budgeteer"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Name" = "budgeteer-log-group"
        }
      + tags_all          = {
          + "Name" = "budgeteer-log-group"
        }
    }

  # aws_ecs_cluster.main will be created
  + resource "aws_ecs_cluster" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "budgeteer"
      + tags     = {
          + "Name" = "budgeteer-cluster"
        }
      + tags_all = {
          + "Name" = "budgeteer-cluster"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_service.main will be created
  + resource "aws_ecs_service" "main" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 1
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + health_check_grace_period_seconds  = 30
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "budgeteer"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Name" = "budgeteer-service"
        }
      + tags_all                           = {
          + "Name" = "budgeteer-service"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "budgeteer-repo"
          + container_port   = 3000
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = true
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-04ab0928bad1c1f14",
              + "subnet-0eb3c6b896a5c5f24",
              + "subnet-0ee5e27c463e9e158",
            ]
        }
    }

  # aws_ecs_task_definition.app will be created
  + resource "aws_ecs_task_definition" "app" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (sensitive value)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "budgeteer"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Name" = "budgeteer-task-definition"
        }
      + tags_all                 = {
          + "Name" = "budgeteer-task-definition"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false
    }

  # aws_iam_policy.deployment_policy will be created
  + resource "aws_iam_policy" "deployment_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for CI/CD deployment"
      + id               = (known after apply)
      + name             = "budgeteer-deployment-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.ecs_autoscale_policy will be created
  + resource "aws_iam_policy" "ecs_autoscale_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for ECS auto scaling"
      + id               = (known after apply)
      + name             = "budgeteer-ecs-autoscale-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecs:DescribeServices",
                          + "ecs:UpdateService",
                          + "cloudwatch:DescribeAlarms",
                          + "cloudwatch:PutMetricAlarm",
                          + "cloudwatch:DeleteAlarms",
                          + "cloudwatch:DescribeAlarmHistory",
                          + "cloudwatch:DescribeAlarmsForMetric",
                          + "cloudwatch:GetMetricStatistics",
                          + "cloudwatch:ListMetrics",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.task_execution_custom will be created
  + resource "aws_iam_policy" "task_execution_custom" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Enhanced permissions for ECS task execution"
      + id               = (known after apply)
      + name             = "budgeteer-task-execution-custom"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-southeast-2:225989367801:log-group:/ecs/budgeteer*",
                          + "arn:aws:logs:ap-southeast-2:225989367801:log-group:/aws/ecs/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:GetParametersByPath",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ap-southeast-2:225989367801:parameter/budgeteer/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-southeast-2:225989367801:secret:budgeteer/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.task_role_policy will be created
  + resource "aws_iam_policy" "task_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Permissions for the budgeteer application"
      + id               = (known after apply)
      + name             = "budgeteer-task-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:logs:ap-southeast-2:225989367801:log-group:/ecs/budgeteer*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameter",
                          + "ssm:GetParameters",
                          + "ssm:GetParametersByPath",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ap-southeast-2:225989367801:parameter/budgeteer/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.deployment_role will be created
  + resource "aws_iam_role" "deployment_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "budgeteer-deployment-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-deployment-role"
          + "Purpose"     = "CI/CD deployment"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-deployment-role"
          + "Purpose"     = "CI/CD deployment"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_autoscale_role will be created
  + resource "aws_iam_role" "ecs_autoscale_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "application-autoscaling.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "budgeteer-ecs-autoscale-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-ecs-autoscale-role"
          + "Purpose"     = "ECS auto scaling"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-ecs-autoscale-role"
          + "Purpose"     = "ECS auto scaling"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.ecs_task_cloudwatch will be created
  + resource "aws_iam_role" "ecs_task_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "budgeteer-ecs-cloudwatch-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-ecs-cloudwatch-role"
          + "Purpose"     = "CloudWatch Container Insights"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-ecs-cloudwatch-role"
          + "Purpose"     = "CloudWatch Container Insights"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.task_execution will be created
  + resource "aws_iam_role" "task_execution" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "budgeteer-task-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-task-execution-role"
          + "Purpose"     = "ECS task execution"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-task-execution-role"
          + "Purpose"     = "ECS task execution"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "budgeteer-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-task-role"
          + "Purpose"     = "ECS application permissions"
        }
      + tags_all              = {
          + "Environment" = "production"
          + "Name"        = "budgeteer-task-role"
          + "Purpose"     = "ECS application permissions"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.ecs_autoscale_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_autoscale_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "budgeteer-ecs-autoscale-role"
    }

  # aws_iam_role_policy_attachment.ecs_cloudwatch_policy will be created
  + resource "aws_iam_role_policy_attachment" "ecs_cloudwatch_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "budgeteer-ecs-cloudwatch-role"
    }

  # aws_iam_role_policy_attachment.task_execution_custom will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "budgeteer-task-execution-role"
    }

  # aws_iam_role_policy_attachment.task_execution_policy will be created
  + resource "aws_iam_role_policy_attachment" "task_execution_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "budgeteer-task-execution-role"
    }

  # aws_iam_role_policy_attachment.task_role_policy will be created
  + resource "aws_iam_role_policy_attachment" "task_role_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "budgeteer-task-role"
    }

  # aws_lb.main will be created
  + resource "aws_lb" "main" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = false
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "budgeteer-alb"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-04ab0928bad1c1f14",
          + "subnet-0eb3c6b896a5c5f24",
          + "subnet-0ee5e27c463e9e158",
        ]
      + tags                                                         = {
          + "Name" = "budgeteer-alb"
        }
      + tags_all                                                     = {
          + "Name" = "budgeteer-alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # aws_lb_listener.app will be created
  + resource "aws_lb_listener" "app" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Name" = "budgeteer-listener"
        }
      + tags_all                                                              = {
          + "Name" = "budgeteer-listener"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.app will be created
  + resource "aws_lb_target_group" "app" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "budgeteer-tg"
      + name_prefix                        = (known after apply)
      + port                               = 3000
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name" = "budgeteer-target-group"
        }
      + tags_all                           = {
          + "Name" = "budgeteer-target-group"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0bc3c549fb54ed59b"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "budgeteer-alb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "budgeteer-alb-sg"
        }
      + tags_all               = {
          + "Name" = "budgeteer-alb-sg"
        }
      + vpc_id                 = "vpc-0bc3c549fb54ed59b"
    }

  # aws_security_group.ecs will be created
  + resource "aws_security_group" "ecs" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 3000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = (known after apply)
              + self             = false
              + to_port          = 3000
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "budgeteer-ecs-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "budgeteer-ecs-sg"
        }
      + tags_all               = {
          + "Name" = "budgeteer-ecs-sg"
        }
      + vpc_id                 = "vpc-0bc3c549fb54ed59b"
    }

Plan: 24 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + alb_hostname              = (known after apply)
  + api_base_url              = (known after apply)
  + autoscale_role_arn        = (known after apply)
  + cloudfront_url            = (known after apply)
  + cloudwatch_role_arn       = (known after apply)
  + deployment_role_arn       = (known after apply)
  + ecs_autoscale_policy_arn  = (known after apply)
  + ecs_cluster_name          = "budgeteer"
  + ecs_service_name          = "budgeteer"
  + load_balancer_url         = (known after apply)
  + log_group_name            = "/ecs/budgeteer"
  + security_group_alb_id     = (known after apply)
  + security_group_ecs_id     = (known after apply)
  + target_group_arn          = (known after apply)
  + task_execution_policy_arn = (known after apply)
  + task_execution_role_arn   = (known after apply)
  + task_policy_arn           = (known after apply)
  + task_role_arn             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

<details>
<summary>Show Apply Output</summary>

```terraform
[0m[1maws_iam_policy.task_execution_custom: Creating...[0m[0m
[0m[1maws_cloudwatch_log_group.app: Creating...[0m[0m
[0m[1maws_security_group.alb: Creating...[0m[0m
[0m[1maws_iam_role.ecs_task_cloudwatch: Creating...[0m[0m
[0m[1maws_iam_policy.task_role_policy: Creating...[0m[0m
[0m[1maws_iam_role.ecs_autoscale_role: Creating...[0m[0m
[0m[1maws_iam_policy.ecs_autoscale_policy: Creating...[0m[0m
[0m[1maws_iam_role.deployment_role: Creating...[0m[0m
[0m[1maws_iam_role.task_execution: Creating...[0m[0m
[0m[1maws_lb_target_group.app: Creating...[0m[0m
[0m[1maws_iam_role.task_role: Creating...[0m[0m
[0m[1maws_ecs_cluster.main: Creating...[0m[0m
[0m[1maws_security_group.alb: Creation complete after 5s [id=sg-0866525dc8fcc22ce][0m
[0m[1maws_security_group.ecs: Creating...[0m[0m
[0m[1maws_lb.main: Creating...[0m[0m
[0m[1maws_security_group.ecs: Creation complete after 4s [id=sg-0ae57d63f482aa57d][0m
[0m[1maws_ecs_cluster.main: Still creating... [10s elapsed][0m[0m
[0m[1maws_ecs_cluster.main: Creation complete after 12s [id=arn:aws:ecs:ap-southeast-2:225989367801:cluster/budgeteer][0m

```

</details>